namespace __Name
{
    internal class Program
    {
        // Methods \ Functions - פונקציות חיצוניות - פעולות חיצוניות

        /*
            Methods Struct - מבנה הפעולה
            
            public static [סוג של ערך שהפעולה מחזירה] _Name([סוג של ערך שהפעולה מקבלת] _NameOfParameter, ...)
            {
                // הקוד שהפעולה מבצעת
                
                return __SomeValue__; // בתנאים מסויימים תתצרכו להחזיר ערך על פי איך שקבעתם את הפעולה
            }

            
            כדי לקרוא לפעולה נכתוב את השם שלה עם סוגריים ובתוך הסוגריים נעביר ערכים אם יש
            דוגמה
            _Name(); -- קריאה פשוטה 
            int _Var = _Name(...); -- קריאה שמחזירה ערך

            מספר הערות 

            קודם כל בעת יצירת פעולה חובה לכתוב public static
            כמו כן אם אנחנו לא מחזירים משהו הערך שנתוב להחזרת הפעולה הוא void
            בנוסף חובה תמיד לרשום תנאי כניסה ותנאי יציאה 
            והערה אחרונה, חובה ליצור את הפעולות לפני הפעולה הראשית Main
         */

        // דוגמה לפעולה שמקבלת מספר ומחזירה את המספר בחזקת 2
        // בעת יצירת הפעולה קבעתי שהיא מחזירה ערך שהוא מספר. חובה שאם קבענו משהו שהפעולה תחזיר

        // תנאי כניסה : מספר שלם
        // תנאי יציאה : חזקה של המספר שקיבלנו ב 2
        public static int PowerOf2(int Number)
        {
            // יצרנו מספר חדש שבתוכו יש את החזקת 2 של המספר שקיבלנו
            int NewNumber = Number * Number; 

            // ואז אנחנו מחזירים את המספר החדש שיצרנו
            return NewNumber;
        }

        // דוגמה לפעולה שלא מחזירה כלום

        // תנאי כניסה : לא מקבלת שום ערך
        // תנאי יציאה : כותבת hello
        public static void PrintHello()
        {
            Console.WriteLine("Hello");
        }

        static void Main(string[] args)
        {
            // דוגמה לשימוש
            // יצרנו מספר חדש והצבנו לו 10
            int Number = 10;

            // יצרנו מספר נוסף שמקבל את הערך שהפעולה שלנו מחזירה וקראנו לפעולה והבאנו לה את המספר הראשון שלנו
            int NewNumber = PowerOf2(Number);

            // ובסופו של דבר אנחנו מדפיסים את המספר החדש שקיבלנו
            Console.WriteLine(NewNumber);

            // קריאה לפעולה השנייה שיצרנו
            PrintHello();
        }
    }
}
