namespace FullExplainFromStart
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // While Loops - לולאות ללא תווך מוגדר

            /*
                    While Loop struct - מבנה לולאה
                while (bool value)
                {
                    // כל עוד הערך בתוך הסוגריים נכון הלולאה תרוץ. בתנאי והערך לא נכון הלולאה תיפסק
                    // חשוב מאוד שתיהיה נקודת הפסקה . זאת אומרת שבתנאי כל שהוא הלולאה תיפסק אחרת היא תישאר תקועה לתמיד
                }
             */


            // דוגמה ללואה

            // יוצרים משתנה שהוא מספר ומציבים לו 12
            int Number = 12;
            // הלולאה עושה בדיקה ראשונה שהמספר שלנו גדול מ 0 
            while (Number > 0) 
            { 
                // כל פעם שהלולאה תרוץ היא תחסיר 1 מהמספר
                Number -= 1;

                // וגם תדפיס את המספר
                Console.WriteLine(Number);
            }
            // מתי שהמספר יהיה שווה ל 0 הלולאה תיפסק
            // והקוד הימשיך
        }
    }
}
